In [1]:
#Import Dependencies
import pandas as pd
from sqlalchemy import create_engine, inspect

## More Data Cleaning + Lookup Tables

#### Read in CSVs

In [2]:
USAT_file = 'USAT_Data.csv'
USAT = pd.read_csv(USAT_file)
USAT.head()

,Rank,First_Name,Last_Name,Sex,Age,State,Time,Race,Race.1
0,1,Michael,Alexander,M,50-54,FL,01:02:29.000,87.912,Bartow Blarney Triathlon
1,2,Mark,Hulbert,M,50-54,FL,01:04:06.000,85.695,Bartow Blarney Triathlon
2,3,Brian,Durden,M,35-39,FL,01:05:30.000,83.863,Bartow Blarney Triathlon
3,4,Rodney,Carter,M,40-44,FL,01:05:54.000,83.354,Bartow Blarney Triathlon
4,5,James,Hooppaw,M,25-29,FL,01:06:10.000,83.018,Bartow Blarney Triathlon

In [3]:
NSGA_file = 'NSGAdatapn.csv'
NSGA = pd.read_csv(NSGA_file)
NSGA.head()

   Unnamed: 0     First      Last State          Time  gender    age  Rank
0           0      Dave  CAMPBELL    CA  01:09:09.000    Male  60-64     1
1           1   Derrill     STEPP    CA  01:10:31.000    Male  55-59     2
2           2      Ross    REMBAC    AZ  01:11:19.000    Male  50-54     3
3           3   Vanessa      COOK    NV  01:11:54.000  Female  50-54     4
4           4     Louis   SALAZAR    NM  01:12:30.000    Male  55-59     5

#### Create/Read In Lookup Tables

In [4]:
#read in the states csv
States_file = 'States.csv'
States = pd.read_csv(States_file)

States.index = States.index + 1
States = States.reset_index()
States = States.rename(columns = {'state_name':'State', 'index':'state_id'})

States.head()

   state_id   state_abb State
0         1     Alabama    AL
1         2      Alaska    AK
2         3     Arizona    AZ
3         4    Arkansas    AR
4         5  California    CA

In [5]:
#Need to get the race names to create the race lookup table
race_lup = pd.DataFrame()
race_lup['race_name'] = list(USAT['Race.1'].value_counts().index)
race_lup.index = race_lup.index + 1
race_lup = race_lup.reset_index()
race_lup = race_lup.rename(columns = {'index':'race_id', 'race_name':'Race'})
race_lup = race_lup.append({'race_id':'20','Race':'National Senior Games Triathlon'}, ignore_index=True)
race_lup

   race_id                                               Race
0        1                                Stanford Treeathlon
1        2                            Pasadena Triathlon 2020
2        3                                   Desert Triathlon
3        4                 Las Olas Fort Lauderdale Triathlon
4        5                    Clermont Draft Legal Challenge
5        6                        Winter Wonderland Triathlon
6        7                HITS Triathlon Series: Sarasota, FL
7        8                       UCSB Kendra's Race Triathlon
8        9                                     Tritonman 2020
9       10                                   Iceman Triathlon
10      11        3rd Annual Tri-Family Racing Lake Pleasant
11      12                           Tri-owa Indoor Triathlon
12      13               Shelbyville Triathlon Series Race #1
13      14  Huntington's Disease Triathlon Sprint and Olym...
14      15                         Ultraman Florida Triathlon
15      16                           Bartow Blarney Triathlon
16      17                Chasing Caterpillars Triathlon 2020
17      18  College of the Florida Keys Sprint Triathlon/B...
18      19                                 Florida Ultra Week
19      20                    National Senior Games Triathlon

In [6]:
#Note I made this later and then moved it around, which is why I directly assign the org id below
org_data = [[1,'National Senior Games Association'], [2,'USA Triathlon']]
Orgs = pd.DataFrame(org_data, columns = ['org_id','org_name'])
Orgs

   org_id                           org_name
0       1  National Senior Games Association
1       2                      USA Triathlon

#### Clean NSGA Data and Add in Foreign Key Columns

In [7]:
#The NSGA data needs race information
NSGA['Race'] = 'National Senior Games Triathlon'
NSGA['org_id'] = 1

#drop the unnamed column
NSGA = NSGA.drop(columns = ['Unnamed: 0'])
NSGA.head()

,First,Last,State,Time,gender,age,Rank,Race,org_id
0,Dave,CAMPBELL,CA,01:09:09.000,Male,60-64,1,National Senior Games Triathlon,1
1,Derrill,STEPP,CA,01:10:31.000,Male,55-59,2,National Senior Games Triathlon,1
2,Ross,REMBAC,AZ,01:11:19.000,Male,50-54,3,National Senior Games Triathlon,1
3,Vanessa,COOK,NV,01:11:54.000,Female,50-54,4,National Senior Games Triathlon,1
4,Louis,SALAZAR,NM,01:12:30.000,Male,55-59,5,National Senior Games Triathlon,1

In [8]:
#replace all entries that say "Male" with "M" and "Female" with "F"
NSGA.loc[NSGA.gender == 'Male', 'gender'] = 'M'
NSGA.loc[NSGA.gender == 'Female', 'gender'] = 'F'
NSGA.head()

,First,Last,State,Time,gender,age,Rank,Race,org_id
0,Dave,CAMPBELL,CA,01:09:09.000,M,60-64,1,National Senior Games Triathlon,1
1,Derrill,STEPP,CA,01:10:31.000,M,55-59,2,National Senior Games Triathlon,1
2,Ross,REMBAC,AZ,01:11:19.000,M,50-54,3,National Senior Games Triathlon,1
3,Vanessa,COOK,NV,01:11:54.000,F,50-54,4,National Senior Games Triathlon,1
4,Louis,SALAZAR,NM,01:12:30.000,M,55-59,5,National Senior Games Triathlon,1

In [9]:
NSGA_st = NSGA.merge(States, on = 'State')
NSGA_st

,First,Last,State,Time,gender,age,Rank,Race,org_id,state_id,state_abb
0,Dave,CAMPBELL,CA,01:09:09.000,M,60-64,1,National Senior Games Triathlon,1,5,California
1,Derrill,STEPP,CA,01:10:31.000,M,55-59,2,National Senior Games Triathlon,1,5,California
2,Nina,LAW,CA,01:29:27.000,F,55-59,29,National Senior Games Triathlon,1,5,California
3,Neal,GENDA,CA,01:52:03.000,M,75-79,76,National Senior Games Triathlon,1,5,California
4,Ellen,DEMSKY,CA,02:26:03.000,F,75-79,96,National Senior Games Triathlon,1,5,California
...,...,...,...,...,...,...,...,...,...,...,...
101,ERNEST,SCHILLINGER,VA,02:41:56.000,M,85-89,102,National Senior Games Triathlon,1,46,Virginia
102,Larry,NELSON,TN,01:54:14.000,M,75-79,78,National Senior Games Triathlon,1,42,Tennessee
103,Theresa,CATTERTON-DOHERTY,MD,02:23:03.000,F,50-54,92,National Senior Games Triathlon,1,20,Maryland
104,Patricia,STOLTENBERG,IL,02:51:09.000,F,60-64,105,National Senior Games Triathlon,1,13,Illinois
105,Patsy,LILLEHEI,MN,02:54:41.000,F,75-79,106,National Senior Games Triathlon,1,23,Minnesota

In [10]:
NSGA_st = NSGA_st.drop(columns = ['State','state_abb'])
NSGA_st.head()

,First,Last,Time,gender,age,Rank,Race,org_id,state_id
0,Dave,CAMPBELL,01:09:09.000,M,60-64,1,National Senior Games Triathlon,1,5
1,Derrill,STEPP,01:10:31.000,M,55-59,2,National Senior Games Triathlon,1,5
2,Nina,LAW,01:29:27.000,F,55-59,29,National Senior Games Triathlon,1,5
3,Neal,GENDA,01:52:03.000,M,75-79,76,National Senior Games Triathlon,1,5
4,Ellen,DEMSKY,02:26:03.000,F,75-79,96,National Senior Games Triathlon,1,5

In [11]:
NSGA_full = NSGA_st.merge(race_lup, on = 'Race')
NSGA_full = NSGA_full.drop(columns = ['Race'])
NSGA_full = NSGA_full.rename(columns = {'First':'first_name', 'Last':'last_name', 'Time':'time','gender':'sex','Rank':'ranking'})
NSGA_full.head()

,first_name,last_name,time,sex,age,ranking,org_id,state_id,race_id
0,Dave,CAMPBELL,01:09:09.000,M,60-64,1,1,5,20
1,Derrill,STEPP,01:10:31.000,M,55-59,2,1,5,20
2,Nina,LAW,01:29:27.000,F,55-59,29,1,5,20
3,Neal,GENDA,01:52:03.000,M,75-79,76,1,5,20
4,Ellen,DEMSKY,02:26:03.000,F,75-79,96,1,5,20

#### Clean USAT Data and Add in Foreign Key Columns

In [12]:
#Make the CSVs similar to reach other - in this case the USAT data needs to 
#drop the points column (currently labelled race)
USAT = USAT.drop(columns = ['Race'])
USAT = USAT.rename(columns = {'Race.1':'Race'})
USAT.head()

,Rank,First_Name,Last_Name,Sex,Age,State,Time,Race
0,1,Michael,Alexander,M,50-54,FL,01:02:29.000,Bartow Blarney Triathlon
1,2,Mark,Hulbert,M,50-54,FL,01:04:06.000,Bartow Blarney Triathlon
2,3,Brian,Durden,M,35-39,FL,01:05:30.000,Bartow Blarney Triathlon
3,4,Rodney,Carter,M,40-44,FL,01:05:54.000,Bartow Blarney Triathlon
4,5,James,Hooppaw,M,25-29,FL,01:06:10.000,Bartow Blarney Triathlon

In [13]:
USAT_st = USAT.merge(States, on = 'State')
USAT_st = USAT_st.drop(columns = ['State','state_abb'])
USAT_st['org_id'] = 2
USAT_st.head()

,Rank,First_Name,Last_Name,Sex,Age,Time,Race,state_id,org_id
0,1,Michael,Alexander,M,50-54,01:02:29.000,Bartow Blarney Triathlon,9,2
1,2,Mark,Hulbert,M,50-54,01:04:06.000,Bartow Blarney Triathlon,9,2
2,3,Brian,Durden,M,35-39,01:05:30.000,Bartow Blarney Triathlon,9,2
3,4,Rodney,Carter,M,40-44,01:05:54.000,Bartow Blarney Triathlon,9,2
4,5,James,Hooppaw,M,25-29,01:06:10.000,Bartow Blarney Triathlon,9,2

In [14]:
USAT_full = USAT_st.merge(race_lup, on = 'Race')
USAT_full = USAT_full.drop(columns = ['Race'])
USAT_full = USAT_full.rename(columns = {'Rank':'ranking', 'First_Name':'first_name','Last_Name':'last_name','Sex':'sex','Age':'age','Time':'time'})
USAT_full

,ranking,first_name,last_name,sex,age,time,state_id,org_id,race_id
0,1,Michael,Alexander,M,50-54,01:02:29.000,9,2,16
1,2,Mark,Hulbert,M,50-54,01:04:06.000,9,2,16
2,3,Brian,Durden,M,35-39,01:05:30.000,9,2,16
3,4,Rodney,Carter,M,40-44,01:05:54.000,9,2,16
4,5,James,Hooppaw,M,25-29,01:06:10.000,9,2,16
...,...,...,...,...,...,...,...,...,...
343,17,SARAH,BYERS,F,35-39,01:25:45.000,3,2,10
344,18,JOEY,RUSNAK,M,15-19,01:25:54.000,3,2,10
345,19,JEREMY,MARCY,M,45-49,01:26:12.000,3,2,10
346,20,Erik,Larson,M,40-44,01:26:58.000,3,2,10
347,3,SAMUEL,KOHLL,M,25-29,01:12:41.000,27,2,10

#### Merged Data

In [15]:
full_data = USAT_full.append(NSGA_full)
full_data

,ranking,first_name,last_name,sex,age,time,state_id,org_id,race_id
0,1,Michael,Alexander,M,50-54,01:02:29.000,9,2,16
1,2,Mark,Hulbert,M,50-54,01:04:06.000,9,2,16
2,3,Brian,Durden,M,35-39,01:05:30.000,9,2,16
3,4,Rodney,Carter,M,40-44,01:05:54.000,9,2,16
4,5,James,Hooppaw,M,25-29,01:06:10.000,9,2,16
...,...,...,...,...,...,...,...,...,...
101,102,ERNEST,SCHILLINGER,M,85-89,02:41:56.000,46,1,20
102,78,Larry,NELSON,M,75-79,01:54:14.000,42,1,20
103,92,Theresa,CATTERTON-DOHERTY,F,50-54,02:23:03.000,20,1,20
104,105,Patricia,STOLTENBERG,F,60-64,02:51:09.000,13,1,20
105,106,Patsy,LILLEHEI,F,75-79,02:54:41.000,23,1,20

## Database Upload

In [16]:
#Connect to Database
connect_string = 'postgresql://postgres:ashari63@35.202.87.202/ETL'
engine = create_engine(connect_string)
conn = engine.connect()

In [17]:
#Drop tables if they already exist
engine.execute("drop table if exists organization CASCADE; drop table if exists state CASCADE; drop table if exists race CASCADE; drop table if exists result;")

In [18]:
#Check that the tables are dropped 
inspector = inspect(engine)
inspector.get_table_names()

[]

#### Create Tables

In [19]:
#Create tables 
create_organization = """CREATE TABLE organization (
                        id SERIAL PRIMARY KEY,
                        org_id INT unique,
                        org_name VARCHAR(50),
                        last_updated timestamp default current_timestamp
                        );
                    """

engine.execute(create_organization)

In [20]:
create_state = """CREATE TABLE state (
                        id SERIAL PRIMARY KEY,
                        state_id INT unique,
                        state_abb VARCHAR(2),
                        state_name VARCHAR(50),
                        last_updated timestamp default current_timestamp
                        );
                    """

engine.execute(create_state)

In [21]:
create_race = """CREATE TABLE race (
                        id SERIAL PRIMARY KEY,
                        race_id INT unique,
                        race_name VARCHAR(100),
                        last_updated timestamp default current_timestamp
                        );
                    """

engine.execute(create_race)

In [22]:
create_result = """CREATE TABLE result (
                        id SERIAL PRIMARY KEY,
                        time VARCHAR(30),
                        ranking INT,
                        age VARCHAR(15),
                        state_id INT REFERENCES state(state_id),
                        org_id INT REFERENCES organization(org_id),
                        race_id INT REFERENCES race(race_id),
                        sex VARCHAR(2),
                        first_name VARCHAR(50),
                        last_name VARCHAR(50),
                        last_updated timestamp default current_timestamp
                        );
                    """

engine.execute(create_result)

#### Load DataFrames into Database

In [23]:
States = States.rename(columns = {States.columns[1]:'state_name', States.columns[2]:'state_abb'})
States.head()

   state_id  state_name state_abb
0         1     Alabama        AL
1         2      Alaska        AK
2         3     Arizona        AZ
3         4    Arkansas        AR
4         5  California        CA

In [24]:
States.to_sql(name='state', con = conn, if_exists = 'append', index = False)

In [25]:
Orgs.to_sql(name='organization', con= conn, if_exists = 'append', index = False)

In [26]:
Races = race_lup.rename(columns = {'Race':'race_name'})
Races.head()

  race_id                           race_name
0       1                 Stanford Treeathlon
1       2             Pasadena Triathlon 2020
2       3                    Desert Triathlon
3       4  Las Olas Fort Lauderdale Triathlon
4       5     Clermont Draft Legal Challenge

In [27]:
Races.to_sql(name='race', con = conn, if_exists = 'append', index = False)

In [28]:
full_data.to_sql(name = 'result', con = conn, if_exists = 'append', index = False)

## Prove it Uploaded

In [29]:
test_query = """
                SELECT * 
                FROM result r
                JOIN state s on s.state_id = r.state_id;
             """

In [30]:
test = pd.read_sql(test_query, con = conn)

test.head()

,id,time,ranking,age,state_id,org_id,race_id,sex,first_name,last_name,last_updated,id,state_id,state_abb,state_name,last_updated
0,437,02:30:56.000,100,60-64,1,1,20,F,Susan,LATHER,2020-06-27 05:09:51.198328,1,1,AL,Alabama,2020-06-27 05:09:48.564121
1,436,01:33:43.000,39,70-74,1,1,20,M,Richard,SNOW,2020-06-27 05:09:51.198328,1,1,AL,Alabama,2020-06-27 05:09:48.564121
2,357,02:17:11.000,89,60-64,3,1,20,F,LOU ANN,BRENNAN,2020-06-27 05:09:51.198328,3,3,AZ,Arizona,2020-06-27 05:09:48.564121
3,356,01:57:00.000,82,75-79,3,1,20,F,Sally,EVANS,2020-06-27 05:09:51.198328,3,3,AZ,Arizona,2020-06-27 05:09:48.564121
4,355,01:35:10.000,46,65-69,3,1,20,F,Anne,KING,2020-06-27 05:09:51.198328,3,3,AZ,Arizona,2020-06-27 05:09:48.564121